# Import libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

# Data-set process

In [2]:
train_data = pd.read_csv('train.csv')
test_data = pd.read_csv('test.csv')
# sub = pd.read_csv('gender_submission.csv')

In [3]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
# Test data-set

In [6]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Remove unnecessary columns

In [7]:
train_data.drop(['PassengerId','Name', 'SibSp','Parch','Ticket','Cabin'], axis=1, inplace=True)

In [8]:
train_data.head()

   Survived  Pclass     Sex   Age     Fare Embarked
0         0       3    male  22.0   7.2500        S
1         1       1  female  38.0  71.2833        C
2         1       3  female  26.0   7.9250        S
3         1       1  female  35.0  53.1000        S
4         0       3    male  35.0   8.0500        S

In [9]:
# drop columns of Test dataset

In [10]:
X_test = test_data.drop(['PassengerId','Name', 'SibSp','Parch','Ticket','Cabin'], axis=1)

In [11]:
X_test.head()

   Pclass     Sex   Age     Fare Embarked
0       3    male  34.5   7.8292        Q
1       3  female  47.0   7.0000        S
2       2    male  62.0   9.6875        Q
3       3    male  27.0   8.6625        S
4       3  female  22.0  12.2875        S

## Cleant the missing values

In [12]:
train_data.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
Embarked      2
dtype: int64

In [13]:
train_data['Age'].fillna(train_data['Age'].mean(), inplace=True)
# train_data.dropna(inplace=True)it`s ok but we cant submit out output kaggle needs 418 rows
# train_data.fillna(method ='pad')
train_data["Embarked"].fillna("Q", inplace = True) 
train_data.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
Embarked    0
dtype: int64

In [14]:
train_data.describe()

         Survived      Pclass         Age        Fare
count  891.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118   32.204208
std      0.486592    0.836071   13.002015   49.693429
min      0.000000    1.000000    0.420000    0.000000
25%      0.000000    2.000000   22.000000    7.910400
50%      0.000000    3.000000   29.699118   14.454200
75%      1.000000    3.000000   35.000000   31.000000
max      1.000000    3.000000   80.000000  512.329200

In [15]:
# clean the Test data set missing values

In [16]:
X_test.isnull().sum()

Pclass       0
Sex          0
Age         86
Fare         1
Embarked     0
dtype: int64

In [17]:
X_test['Age'].fillna(X_test['Age'].mean(), inplace=True)
X_test['Fare'].fillna(X_test['Fare'].mean(), inplace=True)
X_test.isnull().sum()

Pclass      0
Sex         0
Age         0
Fare        0
Embarked    0
dtype: int64

In [18]:
X_test.head()

   Pclass     Sex   Age     Fare Embarked
0       3    male  34.5   7.8292        Q
1       3  female  47.0   7.0000        S
2       2    male  62.0   9.6875        Q
3       3    male  27.0   8.6625        S
4       3  female  22.0  12.2875        S

## making independent variable

In [19]:
y_train = train_data['Survived']
X_train = train_data.drop(['Survived'],axis=1 )

In [20]:
X_train.head()

   Pclass     Sex   Age     Fare Embarked
0       3    male  22.0   7.2500        S
1       1  female  38.0  71.2833        C
2       3  female  26.0   7.9250        S
3       1  female  35.0  53.1000        S
4       3    male  35.0   8.0500        S

In [21]:
y_train.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [22]:
X_test.head()

   Pclass     Sex   Age     Fare Embarked
0       3    male  34.5   7.8292        Q
1       3  female  47.0   7.0000        S
2       2    male  62.0   9.6875        Q
3       3    male  27.0   8.6625        S
4       3  female  22.0  12.2875        S

## Encoding categorical data

### Encoding age column

In [23]:
sex_dumm_train = pd.get_dummies(X_train['Sex'],drop_first=True)
X_train.drop(['Sex'],axis=1,inplace=True)
X_train= pd.concat([X_train,sex_dumm_train],axis=1)

X_train.head()

   Pclass   Age     Fare Embarked  male
0       3  22.0   7.2500        S     1
1       1  38.0  71.2833        C     0
2       3  26.0   7.9250        S     0
3       1  35.0  53.1000        S     0
4       3  35.0   8.0500        S     1

In [24]:
sex_dumm_test = pd.get_dummies(X_test['Sex'],drop_first=True)
X_test.drop(['Sex'],axis=1,inplace=True)
X_test= pd.concat([X_test,sex_dumm_test],axis=1)

X_test.head()

   Pclass   Age     Fare Embarked  male
0       3  34.5   7.8292        Q     1
1       3  47.0   7.0000        S     0
2       2  62.0   9.6875        Q     1
3       3  27.0   8.6625        S     1
4       3  22.0  12.2875        S     0

### Encoding embarked column

In [25]:
X_train.head()

   Pclass   Age     Fare Embarked  male
0       3  22.0   7.2500        S     1
1       1  38.0  71.2833        C     0
2       3  26.0   7.9250        S     0
3       1  35.0  53.1000        S     0
4       3  35.0   8.0500        S     1

In [26]:
X_test.head()

   Pclass   Age     Fare Embarked  male
0       3  34.5   7.8292        Q     1
1       3  47.0   7.0000        S     0
2       2  62.0   9.6875        Q     1
3       3  27.0   8.6625        S     1
4       3  22.0  12.2875        S     0

In [27]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
colTrans = ColumnTransformer(transformers=[('encoder', OneHotEncoder(), [3])], remainder='passthrough')
X_train = np.array(colTrans.fit_transform(X_train))

# for test data set
X_test = np.array(colTrans.fit_transform(X_test))

In [28]:
X_train

array([[ 0.        ,  0.        ,  1.        , ..., 22.        ,
         7.25      ,  1.        ],
       [ 1.        ,  0.        ,  0.        , ..., 38.        ,
        71.2833    ,  0.        ],
       [ 0.        ,  0.        ,  1.        , ..., 26.        ,
         7.925     ,  0.        ],
       ...,
       [ 0.        ,  0.        ,  1.        , ..., 29.69911765,
        23.45      ,  0.        ],
       [ 1.        ,  0.        ,  0.        , ..., 26.        ,
        30.        ,  1.        ],
       [ 0.        ,  1.        ,  0.        , ..., 32.        ,
         7.75      ,  1.        ]])

In [29]:
print(X_test)

[[ 0.          1.          0.         ... 34.5         7.8292
   1.        ]
 [ 0.          0.          1.         ... 47.          7.
   0.        ]
 [ 0.          1.          0.         ... 62.          9.6875
   1.        ]
 ...
 [ 0.          0.          1.         ... 38.5         7.25
   1.        ]
 [ 0.          0.          1.         ... 30.27259036  8.05
   1.        ]
 [ 1.          0.          0.         ... 30.27259036 22.3583
   1.        ]]

## Standard Scalling

In [30]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
X_train[:, 5:7] = scaler.fit_transform(X_train [:, 5:7])
X_test[:, 5:7] = scaler.transform(X_test [:, 5:7])

In [31]:
X_test

array([[ 0.        ,  1.        ,  0.        , ..., 34.5       ,
        -0.49078316,  0.73769513],
       [ 0.        ,  0.        ,  1.        , ..., 47.        ,
        -0.50747884, -1.35557354],
       [ 0.        ,  1.        ,  0.        , ..., 62.        ,
        -0.45336687,  0.73769513],
       ...,
       [ 0.        ,  0.        ,  1.        , ..., 38.5       ,
        -0.50244517,  0.73769513],
       [ 0.        ,  0.        ,  1.        , ..., 30.27259036,
        -0.48633742,  0.73769513],
       [ 1.        ,  0.        ,  0.        , ..., 30.27259036,
        -0.19824428,  0.73769513]])

In [32]:
print(X_train)

[[ 0.          0.          1.         ... 22.         -0.50244517
   0.73769513]
 [ 1.          0.          0.         ... 38.          0.78684529
  -1.35557354]
 [ 0.          0.          1.         ... 26.         -0.48885426
  -1.35557354]
 ...
 [ 0.          0.          1.         ... 29.69911765 -0.17626324
  -1.35557354]
 [ 1.          0.          0.         ... 26.         -0.04438104
   0.73769513]
 [ 0.          1.          0.         ... 32.         -0.49237783
   0.73769513]]

# Select the model

In [2]:
# from sklearn.model_selection import GridSearchCV
# from sklearn.tree import DecisionTreeClassifier
# from sklearn.neighbors import KNeighborsClassifier
# from sklearn.svm import SVC

In [3]:

# #create param
# model_param = {
#     'DecisionTreeClassifier':{
#         'model':DecisionTreeClassifier(),
#         'param':{
#             'criterion': ['gini','entropy']
#         }
#     },
#         'KNeighborsClassifier':{
#         'model':KNeighborsClassifier(),
#         'param':{
#             'n_neighbors': [5,10,15,20,25]
#         }
#     },
#         'SVC':{
#         'model':SVC(),
#         'param':{
#             'kernel':['rbf','linear','sigmoid'],
#             'C': [0.1, 1, 10, 100]
         
#         }
#     }
# }

In [4]:
# scores =[]
# for model_name, mp in model_param.items():
#     model_selection = GridSearchCV(estimator=mp['model'],param_grid=mp['param'],cv=5,return_train_score=False)
#     model_selection.fit(X,y)
#     scores.append({
#         'model': model_name,
#         'best_score': model_selection.best_score_,
#         'best_params': model_selection.best_params_
#     })

In [5]:
# df_model_score = pd.DataFrame(scores,columns=['model','best_score','best_params'])
# df_model_score

# Train the model

In [33]:
from sklearn.svm import SVC
svc = SVC(C=100, kernel='rbf')
svc.fit(X_train,y_train)

In [35]:
pred = svc.predict(X_test)

In [41]:
submission = pd.DataFrame({
        "PassengerId": test_data['PassengerId'],
        "Survived": pred
    })

In [42]:
submission.to_csv('titanic_sub2.csv',index=False)